In [1]:
# import pandas with alias pd to work with it.
# import numpy with alias np to work with it.
import pandas as pd
import numpy as np

1. Write a Pandas program to display the default index and set a column as an Index in a given dataframe.

In [3]:
df = pd.DataFrame({
    'school_code': ['s001','s002','s003','s001','s002','s004'],
    'class': ['V', 'V', 'VI', 'VI', 'V', 'VI'],
    'name': ['Alberto Franco','Gino Mcneill','Ryan Parkes', 'Eesha Hinton', 'Gino Mcneill', 'David Parkes'],
    'date_Of_Birth': ['15/05/2002','17/05/2002','16/02/1999','25/09/1998','11/05/2002','15/09/1997'],
    'weight': [35, 32, 33, 30, 31, 32],
    'address': ['street1', 'street2', 'street3', 'street1', 'street2', 'street4'],
    't_id':['t1', 't2', 't3', 't4', 't5', 't6']})

print(df)
# df.set_index(col_name): this method sets the column as index of the df
df.set_index('school_code', inplace=True)
print(df)

  school_code class            name date_Of_Birth  weight  address t_id
0        s001     V  Alberto Franco    15/05/2002      35  street1   t1
1        s002     V    Gino Mcneill    17/05/2002      32  street2   t2
2        s003    VI     Ryan Parkes    16/02/1999      33  street3   t3
3        s001    VI    Eesha Hinton    25/09/1998      30  street1   t4
4        s002     V    Gino Mcneill    11/05/2002      31  street2   t5
5        s004    VI    David Parkes    15/09/1997      32  street4   t6
            class            name date_Of_Birth  weight  address t_id
school_code
s001            V  Alberto Franco    15/05/2002      35  street1   t1
s002            V    Gino Mcneill    17/05/2002      32  street2   t2
s003           VI     Ryan Parkes    16/02/1999      33  street3   t3
s001           VI    Eesha Hinton    25/09/1998      30  street1   t4
s002            V    Gino Mcneill    11/05/2002      31  street2   t5
s004           VI    David Parkes    15/09/1997      32  street4   t6

2. Write a Pandas program to create a multi Index frame using two columns and using an Index and a column.

In [7]:
df = pd.DataFrame({
    'school_code': ['s001','s002','s003','s001','s002','s004'],
    'class': ['V', 'V', 'VI', 'VI', 'V', 'VI'],
    'name': ['Alberto Franco','Gino Mcneill','Ryan Parkes', 'Eesha Hinton', 'Gino Mcneill', 'David Parkes'],
    'date_Of_Birth': ['15/05/2002','17/05/2002','16/02/1999','25/09/1998','11/05/2002','15/09/1997'],
    'weight': [35, 32, 33, 30, 31, 32],
    'address': ['street1', 'street2', 'street3', 'street1', 'street2', 'street4'],
    't_id':['t1', 't2', 't3', 't4', 't5', 't6']})

# multi Index df using two cols
# here we can use df.set_index() method
df1 = df.set_index(['school_code', 't_id'])
print('Multi Index')
print(df1)

# to create multi index using default index and a column.
df2 = df.set_index([df.index, 'school_code'])
print('Multi Index with default index and a column: ')
print(df2)

Multi Index
                 class            name date_Of_Birth  weight  address
school_code t_id
s001        t1       V  Alberto Franco    15/05/2002      35  street1
s002        t2       V    Gino Mcneill    17/05/2002      32  street2
s003        t3      VI     Ryan Parkes    16/02/1999      33  street3
s001        t4      VI    Eesha Hinton    25/09/1998      30  street1
s002        t5       V    Gino Mcneill    11/05/2002      31  street2
s004        t6      VI    David Parkes    15/09/1997      32  street4
Multi Index with default index and a column:
              class            name date_Of_Birth  weight  address t_id
  school_code
0 s001            V  Alberto Franco    15/05/2002      35  street1   t1
1 s002            V    Gino Mcneill    17/05/2002      32  street2   t2
2 s003           VI     Ryan Parkes    16/02/1999      33  street3   t3
3 s001           VI    Eesha Hinton    25/09/1998      30  street1   t4
4 s002            V    Gino Mcneill    11/05/2002      31  street2   t5
5 s004           VI    David Parkes    15/09/1997      32  street4   t6

3. Write a Pandas program to create a dataframe and set a title or name of the index column.

In [8]:
df = pd.DataFrame({
    'school_code': ['s001','s002','s003','s001','s002','s004'],
    'class': ['V', 'V', 'VI', 'VI', 'V', 'VI'],
    'name': ['Alberto Franco','Gino Mcneill','Ryan Parkes', 'Eesha Hinton', 'Gino Mcneill', 'David Parkes'],
    'date_Of_Birth': ['15/05/2002','17/05/2002','16/02/1999','25/09/1998','11/05/2002','15/09/1997'],
    'weight': [35, 32, 33, 30, 31, 32],
    'address': ['street1', 'street2', 'street3', 'street1', 'street2', 'street4'],
    't_id':['t1', 't2', 't3', 't4', 't5', 't6']})

# df.index.name property can be used to assign a name to the index of the df.
df.index.name = 'index_name'
df

,school_code,class,name,date_Of_Birth,weight,address,t_id
index_name,,,,,,,
0,s001,V,Alberto Franco,15/05/2002,35,street1,t1
1,s002,V,Gino Mcneill,17/05/2002,32,street2,t2
2,s003,VI,Ryan Parkes,16/02/1999,33,street3,t3
3,s001,VI,Eesha Hinton,25/09/1998,30,street1,t4
4,s002,V,Gino Mcneill,11/05/2002,31,street2,t5
5,s004,VI,David Parkes,15/09/1997,32,street4,t6

4. Write a Pandas program to set value in a specific cell in a given dataframe using index.

In [12]:
df = pd.DataFrame({
    'school_code': ['s001','s002','s003','s001','s002','s004'],
    'class': ['V', 'V', 'VI', 'VI', 'V', 'VI'],
    'name': ['Alberto Franco','Gino Mcneill','Ryan Parkes', 'Eesha Hinton', 'Gino Mcneill', 'David Parkes'],
    'date_Of_Birth': ['15/05/2002','17/05/2002','16/02/1999','25/09/1998','11/05/2002','15/09/1997'],
    'weight': [35, 32, 33, 30, 31, 32],
    'address': ['street1', 'street2', 'street3', 'street1', 'street2', 'street4'],
    't_id':['t1', 't2', 't3', 't4', 't5', 't6']})

print(df)
# lets change the name of the student at index 3.
# df.loc[row, col] : This property can be used to access the cell of the df.
df.loc[3, 'name'] = 'Madhav'
print('name changed')
print(df)

  school_code class            name date_Of_Birth  weight  address t_id
0        s001     V  Alberto Franco    15/05/2002      35  street1   t1
1        s002     V    Gino Mcneill    17/05/2002      32  street2   t2
2        s003    VI     Ryan Parkes    16/02/1999      33  street3   t3
3        s001    VI    Eesha Hinton    25/09/1998      30  street1   t4
4        s002     V    Gino Mcneill    11/05/2002      31  street2   t5
5        s004    VI    David Parkes    15/09/1997      32  street4   t6
name changed
  school_code class            name date_Of_Birth  weight  address t_id
0        s001     V  Alberto Franco    15/05/2002      35  street1   t1
1        s002     V    Gino Mcneill    17/05/2002      32  street2   t2
2        s003    VI     Ryan Parkes    16/02/1999      33  street3   t3
3        s001    VI          Madhav    25/09/1998      30  street1   t4
4        s002     V    Gino Mcneill    11/05/2002      31  street2   t5
5        s004    VI    David Parkes    15/09/1997      32  street4   t6

5. Write a Pandas program to convert 1st and 3rd levels in the index into columns from a multiple level of index frame of a given dataframe.

In [15]:
df = pd.DataFrame({
    'school_code': ['s001','s002','s003','s001','s002','s004'],
    'class': ['V', 'V', 'VI', 'VI', 'V', 'VI'],
    'name': ['Alberto Franco','Gino Mcneill','Ryan Parkes', 'Eesha Hinton', 'Gino Mcneill', 'David Parkes'],
    'date_of_birth': ['15/05/2002','17/05/2002','16/02/1999','25/09/1998','11/05/2002','15/09/1997'],
    'weight': [35, 32, 33, 30, 31, 32],
    't_id': ['t1', 't2', 't3', 't4', 't5', 't6']})

# lets create 3 levels of index in df
df1 = df.set_index(['school_code', 't_id', 'date_of_birth'])
print('3 level of index')
print(df1)

# converting 1 and 3 level of index into column.
df2 = df1.reset_index(level=['school_code', 'date_of_birth'])
print('1 level of index')
print(df2)

3 level of index
                               class            name  weight
school_code t_id date_of_birth
s001        t1   15/05/2002        V  Alberto Franco      35
s002        t2   17/05/2002        V    Gino Mcneill      32
s003        t3   16/02/1999       VI     Ryan Parkes      33
s001        t4   25/09/1998       VI    Eesha Hinton      30
s002        t5   11/05/2002        V    Gino Mcneill      31
s004        t6   15/09/1997       VI    David Parkes      32
1 level of index
     school_code date_of_birth class            name  weight
t_id
t1          s001    15/05/2002     V  Alberto Franco      35
t2          s002    17/05/2002     V    Gino Mcneill      32
t3          s003    16/02/1999    VI     Ryan Parkes      33
t4          s001    25/09/1998    VI    Eesha Hinton      30
t5          s002    11/05/2002     V    Gino Mcneill      31
t6          s004    15/09/1997    VI    David Parkes      32

6. Write a Pandas program to extract a single row, rows and a specific value from a DataFrame.

In [22]:
df = pd.DataFrame({
    'school_code': ['s001','s002','s003','s001','s002','s004'],
    'class': ['V', 'V', 'VI', 'VI', 'V', 'VI'],
    'name': ['Alberto Franco','Gino Mcneill','Ryan Parkes', 'Eesha Hinton', 'Gino Mcneill', 'David Parkes'],
    'date_of_birth': ['15/05/2002','17/05/2002','16/02/1999','25/09/1998','11/05/2002','15/09/1997'],
    'weight': [35, 32, 33, 30, 31, 32],
    't_id': ['t1', 't2', 't3', 't4', 't5', 't6']})

print(df)
# df.loc[row, col] : this property allows us to access the specified rows and cols
# let's extract 4th row
print('\n4th row: ')
print(df.loc[3])

# let's extract rows 2 to 4
print('\n2nd row to 4th row: ')
print(df.loc[1:4])

# let's extract specific value of 4th row and 2nd column
print('\n value in 4th row and 2nd col: ')
print(df.loc[3, 'class'])

  school_code class            name date_of_birth  weight t_id
0        s001     V  Alberto Franco    15/05/2002      35   t1
1        s002     V    Gino Mcneill    17/05/2002      32   t2
2        s003    VI     Ryan Parkes    16/02/1999      33   t3
3        s001    VI    Eesha Hinton    25/09/1998      30   t4
4        s002     V    Gino Mcneill    11/05/2002      31   t5
5        s004    VI    David Parkes    15/09/1997      32   t6

4th row:
school_code              s001
class                      VI
name             Eesha Hinton
date_of_birth      25/09/1998
weight                     30
t_id                       t4
Name: 3, dtype: object

2nd row to 4th row:
  school_code class          name date_of_birth  weight t_id
1        s002     V  Gino Mcneill    17/05/2002      32   t2
2        s003    VI   Ryan Parkes    16/02/1999      33   t3
3        s001    VI  Eesha Hinton    25/09/1998      30   t4
4        s002     V  Gino Mcneill    11/05/2002      31   t5

 value in 4th row and 2nd col:
VI

7. Write a Pandas program to extract elements in the given positional indices along an axis of a dataframe.

In [27]:
df = pd.DataFrame({
    'school_code': ['s001','s002','s003','s001','s002','s004'],
    'class': ['V', 'V', 'VI', 'VI', 'V', 'VI'],
    'name': ['Alberto Franco','Gino Mcneill','Ryan Parkes', 'Eesha Hinton', 'Gino Mcneill', 'David Parkes'],
    'date_of_birth': ['15/05/2002','17/05/2002','16/02/1999','25/09/1998','11/05/2002','15/09/1997'],
    'weight': [35, 32, 33, 30, 31, 32],
    't_id': ['t1', 't2', 't3', 't4', 't5', 't6']})

# df.take(indices, axis) : this method extract the specific value with passed indices along axis.
# axis = 1, returns the column
# let's extract 3rd column
print(df.take([2], axis=1))

# axis = 0, returns the row
# let's extract 3rd row

print('\n', df.take([2], axis=0))

             name
0  Alberto Franco
1    Gino Mcneill
2     Ryan Parkes
3    Eesha Hinton
4    Gino Mcneill
5    David Parkes

   school_code class         name date_of_birth  weight t_id
2        s003    VI  Ryan Parkes    16/02/1999      33   t3

8. Write a Pandas program to find integer index of rows with missing data in a given dataframe.

In [64]:
df = pd.DataFrame({
    'school_code': ['s001','s002','s003','s001','s002','s004'],
    'class': ['V', 'V', 'VI', 'VI', 'V', 'VI'],
    'name': ['Alberto Franco','Gino Mcneill','Ryan Parkes', 'Eesha Hinton', 'Gino Mcneill', 'David Parkes'],
    'date_of_birth': ['15/05/2002','17/05/2002','16/02/1999','25/09/1998','11/05/2002','15/09/1997'],
    'weight': [35, None, 33, 30, 31, None],
    't_id': ['t1', 't2', 't3', 't4', 't5', 't6']})

# the below line of code check for the weight column is any null value is present then, index is stored in index variable.
index = df['weight'].index[df['weight'].apply(np.isnan)]
index.values

array([1, 5], dtype=int64)